questions = [
    {
        "question": "ما هي لغة البرمجة المستخدمة في تطوير أندرويد؟",
        "options": ["جافا", "بايثون", "روبي", "سي شارب"],
        "answer": "جافا"
    },
    {
        "question": "ما هو العضو الأكبر في جسم الإنسان؟",
        "options": ["الكبد", "القلب", "الجلد", "الرئتين"],
        "answer": "الجلد"
    },
    {
        "question": "كم عدد أضلاع المثلث؟",
        "options": ["2", "3", "4", "5"],
        "answer": "3"
    },
    {
        "question": "في أي قارة تقع مصر؟",
        "options": ["آسيا", "أفريقيا", "أوروبا", "أمريكا الجنوبية"],
        "answer": "أفريقيا"
    },
    {
        "question": "ما هو عنصر الهيدروجين في الجدول الدوري؟",
        "options": ["1", "2", "3", "4"],
        "answer": "1"
    },
    {
        "question": "ما اسم أكبر كوكب في النظام الشمسي؟",
        "options": ["المريخ", "المشتري", "زحل", "أورانوس"],
        "answer": "المشتري"
    }
]
