questions = [
    {
        "question": "ما هو اسم أول قمر صناعي أطلقه الإنسان؟",
        "options": ["سبوتنيك 1", "أبوللو 11", "هابل", "مارس روفر"],
        "answer": "سبوتنيك 1"
    },
    {
        "question": "ما هي أصغر عظمة في جسم الإنسان؟",
        "options": ["الركبة", "الركاب", "الكتف", "الجمجمة"],
        "answer": "الركاب"
    },
    {
        "question": "ما هو الغاز الذي نتنفسه؟",
        "options": ["ثاني أكسيد الكربون", "الأكسجين", "النيتروجين", "الهيدروجين"],
        "answer": "الأكسجين"
    },
    {
        "question": "ما هو اسم الجهاز الذي يستخدم لقياس الزلازل؟",
        "options": ["التلسكوب", "السيسموجراف", "البارومتر", "الهيدرومتر"],
        "answer": "السيسموجراف"
    },
    {
        "question": "من هو مكتشف قانون الجاذبية؟",
        "options": ["ألبرت أينشتاين", "إسحاق نيوتن", "غاليليو غاليلي", "نيكولا تسلا"],
        "answer": "إسحاق نيوتن"
    },
    {
        "question": "ما هو الكوكب الذي يسمى بالكوكب الأحمر؟",
        "options": ["المريخ", "الزهرة", "المشتري", "زحل"],
        "answer": "المريخ"
    },
    {
        "question": "ما هو أكبر محيط في العالم؟",
        "options": ["المحيط الأطلسي", "المحيط الهندي", "المحيط الهادئ", "المحيط المتجمد الشمالي"],
        "answer": "المحيط الهادئ"
    },
    {
        "question": "ما هي الوحدة الأساسية لقياس شدة التيار الكهربائي؟",
        "options": ["فولت", "أوم", "أمبير", "واط"],
        "answer": "أمبير"
    },
    {
        "question": "من هو مؤسس شركة آبل؟",
        "options": ["ستيف جوبز", "بيل غيتس", "مارك زوكربيرج", "لاري بايج"],
        "answer": "ستيف جوبز"
    },
    {
        "question": "ما هي أكبر قارة في العالم؟",
        "options": ["أفريقيا", "آسيا", "أمريكا الشمالية", "أوروبا"],
        "answer": "آسيا"
    }
]
