questions = [
    {
        "question": "ما هو اسم أكبر محيط في العالم؟",
        "options": ["المحيط الأطلسي", "المحيط الهندي", "المحيط الهادئ", "المحيط المتجمد الشمالي"],
        "answer": "المحيط الهادئ"
    },
    {
        "question": "ما هو اسم ثاني أكبر كوكب في النظام الشمسي؟",
        "options": ["المشتري", "زحل", "أورانوس", "نبتون"],
        "answer": "زحل"
    },
    {
        "question": "كم عدد الأسنان في الفم الطبيعي للإنسان البالغ؟",
        "options": ["28", "30", "32", "34"],
        "answer": "32"
    },
    {
        "question": "ما هي الوحدة الأساسية لقياس الطاقة؟",
        "options": ["الجول", "الوات", "الكيلوواط", "الكالوري"],
        "answer": "الجول"
    },
    {
        "question": "من هو مؤسس علم الكيمياء الحديثة؟",
        "options": ["أنتوان لافوازييه", "ديمتري مند
