questions = [
    {
        "question": "ما هو اسم أسرع حيوان بري؟",
        "options": ["الفهد", "الأسد", "الظبي", "الذئب"],
        "answer": "الفهد"
    },
    {
        "question": "ما هو علم دراسة النباتات؟",
        "options": ["علم الحيوان", "علم النبات", "علم الفلك", "علم الكيمياء"],
        "answer": "علم النبات"
    },
    {
        "question": "ما هو العنصر الكيميائي الذي يرمز له بـ O؟",
        "options": ["ذهب", "أكسجين", "حديد", "فضة"],
        "answer": "أكسجين"
    },
    {
        "question": "من هو مؤسس علم النفس؟",
        "options": ["سيغموند فرويد", "كارل ماركس", "ألبرت أينشتاين", "تشارلز داروين"],
        "answer": "سيغموند فرويد"
    },
    {
        "question": "ما هو اسم أكبر بحيرة عذبة في أفريقيا؟",
        "options": ["بحيرة ناصر", "بحيرة فيكتوريا", "بحيرة تانجانيقا", "بحيرة مالاوي"],
        "answer": "بحيرة فيكتوريا"
    },
    {
        "question": "في أي سنة هبط الإنسان لأول مرة على القمر؟",
        "options": ["1965", "1969", "1972", "1959"],
        "answer": "1969"
    },
    {
        "question": "ما هو اسم العضو المسؤول عن التنفس؟",
        "options": ["القلب", "الرئتان", "المعدة", "الكبد"],
        "answer": "الرئتان"
    },
    {
        "question": "ما هي أصغر وحدة في الكائن الحي؟",
        "options": ["العضو", "الخلية", "الأنسجة", "الجين"],
        "answer": "الخلية"
    },
    {
        "question": "ما هو اسم أكبر نهر في أمريكا الجنوبية؟",
        "options": ["الأمازون", "البارانا", "الأورينوكو", "الميسيسيبي"],
        "answer": "الأمازون"
    }
]
