questions = [
    {
        "question": "ما هو الحيوان الوطني في مصر؟",
        "options": ["الأسد", "النسر", "الصقر", "التمساح"],
        "answer": "التمساح"
    },
    {
        "question": "كم عدد الكواكب في النظام الشمسي؟",
        "options": ["7", "8", "9", "10"],
        "answer": "8"
    },
    {
        "question": "ما هو أطول نهر في العالم؟",
        "options": ["الأمازون", "النيل", "الغانج", "اليانغتسي"],
        "answer": "النيل"
    },
    {
        "question": "ما هي عاصمة اليابان؟",
        "options": ["أوساكا", "طوكيو", "كيونتو", "هيروشيما"],
        "answer": "طوكيو"
    },
    {
        "question": "من كتب رواية 'مئة عام من العزلة'؟",
        "options": ["غابرييل غارسيا ماركيز", "بابلو نيرودا", "خورخي بورخيس", "ماريو فارغاس يوسا"],
        "answer": "غابرييل غارسيا ماركيز"
    }
]
