questions = [
    {
        "question": "ما هو اسم أطول جسر في العالم؟",
        "options": ["جسر البوابة الذهبية", "جسر الملك فهد", "جسر دانيانغ-كونشان الكبير", "جسر لندن"],
        "answer": "جسر دانيانغ-كونشان الكبير"
    },
    {
        "question": "من هو مكتشف البنسلين؟",
        "options": ["ألكسندر فليمنج", "ماريا كوري", "لويس باستور", "إسحاق نيوتن"],
        "answer": "ألكسندر فليمنج"
    },
    {
        "question": "ما هي لغة الأندلس القديمة؟",
        "options": ["العربية", "الإسبانية", "اللاتينية", "الفارسية"],
        "answer": "العربية"
    },
    {
        "question": "كم عدد الألوان الأساسية في الطيف؟",
        "options": ["5", "6", "7", "8"],
        "answer": "7"
    },
    {
        "question": "ما هو اسم أكبر بحيرة في العالم؟",
        "options": ["بحيرة فيكتوريا", "بحيرة سوبيريور", "بحيرة كاسبيان", "بحيرة ميتشجن"],
        "answer": "بحيرة كاسبيان"
    },
    {
        "question": "ما هي وحدة قياس شدة التيار الكهربائي؟",
        "options": ["فولت", "أوم", "أمبير", "وات"],
        "answer": "أمبير"
    },
    {
        "question": "ما هو الجهاز المسؤول عن ضخ الدم في الجسم؟",
        "options": ["الرئة", "الكبد", "القلب", "الدماغ"],
        "answer": "القلب"
    },
    {
        "question": "ما هو اسم أكبر محيط في العالم؟",
        "options": ["المحيط الهادئ", "المحيط الأطلسي", "المحيط الهندي", "المحيط المتجمد الشمالي"],
        "answer": "المحيط الهادئ"
    }
]
