questions = [
    {
        "question": "ما هو الحيوان الذي يُعرف بـ 'ملك الغابة'؟",
        "options": ["الأسد", "النمر", "الفهد", "الفيل"],
        "answer": "الأسد"
    },
    {
        "question": "ما هو أسرع طائر في العالم؟",
        "options": ["الصقر", "النسر", "القطا", "الحمامة"],
        "answer": "الصقر"
    },
    {
        "question": "ما هو الكوكب الأحمر؟",
        "options": ["المريخ", "الزهرة", "عطارد", "المشتري"],
        "answer": "المريخ"
    },
    {
        "question": "من هو مؤسس شركة مايكروسوفت؟",
        "options": ["بيل غيتس", "ستيف جوبز", "مارك زوكربيرج", "لاري بيج"],
        "answer": "بيل غيتس"
    },
    {
        "question": "ما هو عدد القارات في العالم؟",
        "options": ["5", "6", "7", "8"],
        "answer": "7"
    },
    {
        "question": "ما هو اسم أسرع حيوان بحري؟",
        "options": ["الدلفين", "القرش", "سمك أبو سيف", "الأخطبوط"],
        "answer": "سمك أبو سيف"
    },
    {
        "question": "ما هو المعدن المستخدم لصنع المجوهرات الثمينة؟",
        "options": ["الذهب", "الحديد", "النحاس", "الألمنيوم"],
        "answer": "الذهب"
    }
]
